Autodesk.Revit.DB.HostObject.FindInserts(System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Gets the ids of the instances inserted into this host object.
addRectOpenings:
True if rectangular openings should be included in the return.
includeShadows:
True if shadows should be included in the return.
includeEmbeddedWalls:
True if embedded walls should be included in the return.
includeSharedEmbeddedInserts:
True if shared embedded inserts should be included in the return.
Returns:
All the insertable instances' ids.

Autodesk.Revit.DB.HostObject
A base class that provides support for all objects that can host other objects, such as walls roofs, and floors.